fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);

	ДиаграммаГанта.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Истина;
	Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Вставить(0);
	Шкала.Единица = ТипЕдиницыШкалыВремени.Неделя;
	Серия = ДиаграммаГанта.Серии.Добавить();

	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
		Точка = ДиаграммаГанта.Точки.Добавить();
		Точка.Текст = Отпуск.Сотрудник;

		Интервал = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия).Добавить();
		Интервал.Цвет = ЦветаСтиля.ЦветМеткиСиний;
		Интервал.Начало = НачалоДня(Отпуск.ДатаНачала);
		Интервал.Конец = КонецДня(Отпуск.ДатаОкончания); 
	КонецЦикла;
	
//	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
